[
    {
        "id": "developer-protfolio",
        "title": "Developer Protfolio",
        "image": "../src/assets/protfolio.jpg",
        "techStack": "HTML, CSS",
        "description": "personal portfolio website designed to present my profile, skills, education, and projects in a simple and professional layout. The site focuses on clean design and clear content to create an effective online presence as a front-end developer.",
        "challenges": "Making the layout clean and responsive without using JavaScript.",
        "future": "Adding interactive elements, improving mobile responsiveness, and integrating a functional contact form.",
        "live": "https://comfy-kashata-db805a.netlify.app/",
        "github": "https://github.com/AtiqueShahriarArnob/protfolio"
    },
    {
        "id": "fitness-app",
        "title": "Fitness Application",
        "image": "../src/assets/gym-image.jpg",
        "techStack": "HTML, CSS",
        "description": "A fitness-themed landing page showcasing workout plans, pricing, BMI calculator information, and fitness goals with a clean and structured layout.",
        "challenges": "Ensuring consistent section styling and layout using only HTML and CSS.",
        "future": "Adding interactivity (such as functional BMI calculator and navigation) and improving mobile responsiveness.",
        "live": "https://atiqueshahriararnob.github.io/asgmt-two/",
        "github": "https://github.com/AtiqueShahriarArnob/asgmt-two"
    },
    {
        "id": "architect-website",
        "title": "Architect Website",
        "image": "../src/assets/banner.png",
        "techStack": "HTML, CSS",
        "description": "A creative interior design landing page showcasing architecture-style visuals, service sections, a portfolio grid, customer reviews, and a contact section in a modern layout.",
        "challenges": "Organizing multiple content sections and layouts using only HTML and CSS.",
        "future": "Adding animations, enhancing responsiveness for all screen sizes, and integrating a working contact form.",
        "live": "https://atiqueshahriararnob.github.io/asgmt-three/",
        "github": "https://github.com/AtiqueShahriarArnob/asgmt-three"
    },
    {
        "id": "bike-zone",
        "title": "Bike Zone",
        "image": "../src/assets/latest2.png",
        "techStack": "HTML, CSS, Bootstrap",
        "description": "A motorcycle-themed landing page featuring product showcases, latest news sections, an FAQ accordion, and customer testimonial visuals with a modern Bootstrap-based layout.",
        "challenges": "structuring multiple sections and maintaining a consistent design using Bootstrap’s grid system and components.",
        "future": "Adding interactive JavaScript features (e.g., dynamic sliders and form validation) and improving responsiveness on all devices.",
        "live": "https://astounding-rugelach-5edea8.netlify.app/",
        "github": "https://github.com/AtiqueShahriarArnob/bootstrap-assignment"
    },
    {
        "id": "donate-bangladesh",
        "title": "Donate Bangladesh",
        "image": "../src/assets/donate-bangladesh.png",
        "techStack": "HTML, CSS,Tailwind CSS,DaisyUI, JavaScript",
        "description": "A donation website UI that displays donation causes and allows users to interact with donation-related content, including simple on‑page calculations using JavaScript.",
        "challenges": "Implementing donation logic and structuring multiple content sections using HTML, CSS, and JavaScript.",
        "future": "Enhancing interactivity further, improving mobile responsiveness, and adding backend integration for real donation processing.",
        "live": "https://atiqueshahriararnob.github.io/asgmt-five/",
        "github": "https://github.com/AtiqueShahriarArnob/asgmt-five"
    },
    {
        "id": "my-eleven",
        "title": "My-Eleven",
        "image": "../src/assets/my-eleven.png",
        "techStack": "HTML5, CSS3,Tailwind CSS,JavaScript",
        "description": "A sports team management app where users claim credits to 'buy' players. Features a dynamic balance system, a player selection limit (6 players), and a toggleable view between available and selected players.",
        "challenges": "Implementing strict validation logic to prevent duplicate selections and managing team size limits dynamically.",
        "future": "Adding smooth scroll-triggered animations, refining the mobile layout for better touch-target accuracy, and integrating a backend to save user-created teams.",
        "live": "https://aesthetic-seahorse-81117d.netlify.app/",
        "github": "https://github.com/AtiqueShahriarArnob/My-eleven"
    },
    {
        "id": "Gadget-Heaven",
        "title": "Gadget-Heaven",
        "image": "../src/assets/haven.png",
        "techStack": "React.js, Tailwind CSS, DaisyUI, React Router DOM",
        "description": "feature-rich e-commerce platform called 'Gadget Heaven' that allows users to browse tech products by category, view detailed product specifications, and manage both a shopping cart and a wishlist.",
        "challenges": " Managing complex application states to ensure the cart and wishlist counts update accurately across different routes while preventing duplicate entries in the wishlist.",
        "future": "Enhancing interactivity further, improving mobile responsiveness, and adding backend integration for real-time inventory management and payment processing.",
        "live": "https://velvety-baklava-03052d.netlify.app/",
        "github": "https://github.com/AtiqueShahriarArnob/Gadget-Heaven"
    },
    {
        "id": "eco-adventure-experiences",
        "title": "Eco-Adventure Experiences",
        "image": "../src/assets/eco.jpg",
        "techStack": "React.js, Tailwind CSS, DaisyUI, Firebase Authentication, React Router DOM, Animate.css / AOS (Animation libraries).",
        "description": "An 'Eco-Adventure' tourism platform that showcases sustainable travel experiences like mountain treks, forest safaris, and ocean dives. The site features secure user authentication (Google/Email), a detailed adventure guide, and an interactive 'Talk to Expert' consultation system.",
        "challenges": "Managing complex state for the food cart.",
        "future": "Implementing secure private routes that redirect unauthenticated users to the login page and managing complex dynamic routing to display specific details for each adventure category.",
        "live": "https://eco-adventure-experience-788bc.firebaseapp.com/",
        "github": "https://github.com/AtiqueShahriarArnob/Eco-Adventure-Experiences"
    },
    {
        "id": "bistro-boss",
        "title": "BistroBoss",
        "image": "../src/assets/bistro-image.jpg",
        "techStack": "React.js, Node.js, Express.js, MongoDB (MERN Stack), Tailwind CSS, Firebase, Stripe.",
        "description": "A professional restaurant management and e-commerce platform that allows users to browse food categories, add items to a cart, and make secure online payments. It includes a dedicated admin dashboard for managing menus, monitoring revenue, and handling user roles.",
        "challenges": "Implementing role-based access control (Admin vs. User) and securing private API routes using JWT (JSON Web Tokens) to ensure data privacy and safe financial transactions.",
        "future": "Enhancing interactivity further, improving mobile responsiveness, and adding backend integration for real-time table booking and a customer review system.",
        "live": "https://bistro-boss-89056.web.app/",
        "github": "https://github.com/AtiqueShahriarArnob/bistro-boss-client"
    }
]